#include <stdio.h>

int a[1010];

int main() {
    int q;
    scanf("%d", &q);
    while(q--) {
        int n;
        scanf("%d", &n);
        int idx = -1, mx = 0; // idx = คำตอบ, mx = ช่วงที่มีค่าใหญ่ที่สุด
        int i;
        for(i = 0; i < n; i++) {
            scanf("%d", &a[i]);
        }
        a[n] = 1; // กำหนดให้ a[n] = 1 เพื่อให้เช็คช่วงสุดท้ายได้
        int cnt = 0;
        for(i = 0; i < n + 1; i++) { // วนเกิน n ช่องเพื่อเช็คช่วงสุดท้าย
            if(a[i] == 1) {
                if(cnt > mx && cnt % 2 == 1) {
                    // ถ้าช่วงนี้ ใหญ่กว่า mx และ มีความยาวเป็นเลขคี่
                    idx = i - cnt / 2 - 1;
                    mx = cnt;
                    /*
                    เราอยู่เลยช่องสุดท้ายของช่วงที่เป็นเลขคี่
                    - 1 เพื่อกลับไปอยู่ที่ช่องสุดท้ายของช่วง
                    - cnt / 2 เพื่อกลับไปอยู่ที่ช่องกลางของช่วง
                    เนื่องจากความยาวช่วงคือ cnt = cnt / 2 + 1 + cnt / 2
                    */
                }
                cnt = 0; // รีเซ็ตค่า cnt
                continue;
            }
            cnt++;
        }
        if(mx == 0) // ถ้าไม่มีช่วงเลขคี่
            printf("-1\n");
        else
            printf("%d\n", idx);
    }
    return 0;
}

/*
4
12
1 0 0 0 1 0 0 0 0 0 1 1
12
0 0 0 1 0 0 0 1 0 0 0 0
12
1 1 1 0 1 1 1 0 1 1 1 1
12
0 0 1 1 0 0 1 1 0 0 0 0
*/