#include <stdio.h>
#include <string.h>

// ประกาศ string 10 ตัว [0 -> 9] ตัวละ 5 ช่อง [ ยาวสุด 4 ตัว + '\0' ]
char button[10][5] =
{
    "", // ปุ่ม 0
    "", // ปุ่ม 1 [i = 0][j = 1]
    "ABC", // ปุ่ม 2 [i = 0][j = 2]
    "DEF", // ปุ่ม 3 [i = 0][j = 3]
    "GHI", // ปุ่ม 4 [i = 1][j = 1]
    "JKL", // ปุ่ม 5 [i = 1][j = 2]
    "MNO", // ปุ่ม 6 [i = 1][j = 3]
    "PQRS", // ปุ่ม 7 [i = 2][j = 1]
    "TUV", // ปุ่ม 8 [i = 2][j = 2]
    "WXYZ" // ปุ่ม 9 [i = 2][j = 3]
};

char ans[80 + 10];

int main() {
    int n;
    scanf("%d", &n);
    int now, t; // now = ปุ่มปัจจุบัน, t = จำนวนครั้งที่กดปุ่ม
    scanf("%d %d", &now, &t);
    
    int i = (now - 1) / 3; // i = แถวที่ 0, 1, 2
    int j = (now - 1) % 3; // j = คอลัมน์ที่ 0, 1, 2
    int len = strlen(button[now]); // len = ความยาวของปุ่มปัจจุบัน

    int cnt = 0; // จำนวนตัวอักษรของคำตอบ

    if(now != 1) { // หากปุ่มเป็น 1 ไม่ต้องทำอะไร
        ans[cnt] = button[now][(t - 1 + len) % len]; // ตัวอักษรแรกของคำตอบ
        // การกด 1 ครั้ง จะได้ตัวอักษร ช่องที่ 0 ของปุ่มปัจจุบัน
        // การกด t ครั้ง จะได้ตัวอักษร ช่องที่ (t - 1) % len ของปุ่มปัจจุบัน
        // อย่างไรก็ตาม (t - 1) % len อาจมีค่าติดลบได้
        // จึงต้อง + len ก่อน % len เพื่อให้ค่าเป็นบวกเสมอ
        // กรณี (0 - 1) % len
        // จะได้ (0 - 1 + len) % len -> (len - 1) % len
        
        cnt++; // เพิ่มจำนวนตัวอักษรของคำตอบ 
    }

    int k;
    for(k = 1; k <= n - 1; k++) { // วน n - 1 รอบ
        int di, dj; // di = ผลต่างแถว, dj = ผลต่างคอลัมน์
        scanf("%d %d %d", &dj, &di, &t); // รับ ผลต่างแถว, ผลต่างคอลัมน์, จำนวนครั้งที่กดปุ่ม
        i += di;
        j += dj;
        now = i * 3 + j + 1; // ปุ่มปัจจุบัน
        len = strlen(button[now]); // ความยาวของปุ่มปัจจุบัน
        if(now == 1) {
            // ลบตัวอักษร t ตัวท้าย
            // ปัจจุบัน ช่องสุดท้ายอยู่ที่ cnt - 1
            while(cnt > 0 && t > 0) { 
                // ลบจนกว่าตัวอักษรจะหมด
                cnt--; // ย้ายกลับมาชี้ที่ตัวอักษรตัวสุดท้าย
                ans[cnt] = '\0'; // เปลี่ยนตัวอักษรสุดท้ายเป็น '\0'
                t--; // ลดจำนวนครั้งการกดปุ่ม
            }
            continue;
        }
        else {
            ans[cnt] = button[now][(t - 1 + len) % len];
            cnt++;
        }
    }
    if(cnt == 0)
        printf("null");
    else
        printf("%s", ans);
    return 0;
}