#include <stdio.h>

int A, B, C; // ความจุเต็มถังของถัง A, B, C

int mark[30][30][30]; // ป้องกันการทำสถานะ a, b, c ซ้ำ

int ans[30]; // Counting Sort เก็บค่า c ทุกรูปแบบที่เคยเกิดขึ้น

void play(int a, int b, int c) {
    if(a < 0 || b < 0 || c < 0 || a > A || b > B || c > C)
        return ; // กรณี ถังมีน้ำเกินความจุ หรือ ถังมีน้ำน้อยกว่า 0 ไม่มีจริง

    if(mark[a][b][c]) // ถ้าเคยอยู่ในสถานะนี้แล้ว ไม่ต้องทำซ้ำ
        return ;
    
    mark[a][b][c] = 1; // ทำเครื่องหมายว่าเคยอยู่ในสถานะนี้แล้ว
    if(!a)
        ans[c] = 1; // ติ๊กไว้ว่า c เคยมีค่าเท่านี้มาแล้ว เมื่อ a == 0

    // เทจาก A ไป B
    play(0, b + a, c); // เทจนถัง A หมด
    play(a - (B - b), B, c); // เทจนถัง B เต็ม

    // เทจาก A ไป C
    play(0, b, c + a); // เทจนถัง A หมด
    play(a - (C - c), b, C); // เทจนถัง C เต็ม

    // เทจาก B ไป A
    play(a + b, 0, c); // เทจนถัง B หมด
    play(A, b - (A - a), c); // เทจนถัง A เต็ม

    // เทจาก B ไป C
    play(a, 0, c + b); // เทจนถัง B หมด
    play(a, b - (C - c), C); // เทจนถัง C เต็ม

    // เทจาก C ไป A
    play(a + c, b, 0); // เทจนถัง C หมด
    play(A, b, c - (A - a)); // เทจนถัง A เต็ม

    // เทจาก C ไป B
    play(a, b + c, 0); // เทจนถัง C หมด
    play(a, B, c - (B - b)); // เทจนถัง B เต็ม
}

int main() {
    scanf("%d %d %d", &A, &B, &C);
    
    play(0, 0, C); // เริ่มที่ 0 0 C
    
    int i;
    for(i = 0; i <= C; i++)
        if(ans[i]) // ถ้าเคยมีค่า c เท่านี้มาแล้ว
            printf("%d ", i);
    return 0;
}